# st-map-test-4.py
import streamlit as st
import pandas as pd

data=pd.DataFrame({
    '地點': ['台北 101', '故宮博物院', '中正紀念堂', '士林夜市', '陽明山國家公園', '松山文創園區'],
    'lat': [25.033968, 25.102398, 25.034194, 25.088200, 25.166748, 25.044150],
    'lon': [121.564468, 121.548492, 121.521880, 121.525000, 121.559845, 121.557510],
    '類別': ['商業地標', '文化地標', '歷史紀念', '夜市美食', '自然景觀', '文創藝術'],
    '人氣': [95, 80, 85, 90, 75, 70],
    '色彩': ['#0000FF', '#00FF00', '#FF0000', [55, 123, 77], [210, 50, 78], [116, 23, 109]]
    })
st.map(
    data,
    latitude='lat',
    longitude='lon',
    size='人氣',
    color='色彩',
    width=600,
    height=400,
    zoom=10,
    use_container_width=False
    )


